benchmark/report/rps/overload/20260804_171435/raw/013_upload_1kb_c2_r1.txt
Running 5s test @ http://127.0.0.1:32782/api/files/upload
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    78.26ms   16.75ms 102.84ms   46.67%
    Req/Sec     2.67      0.48     3.00     66.67%
  Latency Distribution
     50%   81.21ms
     75%   94.32ms
     90%   97.78ms
     99%  102.84ms
  30 requests in 5.03s, 18.39KB read
Requests/sec:      5.97
Transfer/sec:      3.66KB
HPS_WRK_REQUESTS 30
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 30
HPS_STATUS_2XX 30
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 201=30